<template>
    <p class="motivation-text">{{motivationText}}</p>
</template>

<script>

export default {
  name: 'MotivationText',
  data() {
    return {
        motivationArr: [
            '«Если вы тратите слишком много времени, думая о чем-то, то никогда не сделаете это»',
            '«Повышение продуктивности означает меньше человеческого пота»',
            '«Любитель садится и ждет вдохновения. Остальные – просто встают и идут работать»',
            '«Когда мы действительно должны сделать что-то, мы часто этого избегаем»',
            '«Сначала сделай тяжелую работу. Простая работа позаботится о себе сама»',
            '«Большая часть стресса не из-за того, что слишком много нужно сделать, а от незавершенности того, что начали»',
            '«Если вы тратите слишком много времени на размышления, вы никогда это не сделаете»',
            '«Продуктивность – не случайность. Это результат стремления к совершенству, разумного планирования и целенаправленных усилий»',
            '«Чтобы построить дом, вам нужен план. Чтобы устроить жизнь, еще важнее иметь план или цель»',
            '«Ощущение счастья от работы — новый залог продуктивности»',
            '«Чем спокойнее жизнь, тем она продуктивнее»',
            '«В одиночку мы можем сделать так мало, зато сколько мы можем сделать все вместе!»',
            '«Дисциплина — это решение делать то, чего очень не хочется делать, чтобы достичь того, чего очень хочется достичь»',
            '«Ничто, действительно нас интересующее, не тяжело для нас»',
            '«Самая тяжелая работа – та, которую мы не решаемся начать: она становится кошмаром»',
            '«Тяжёлый труд — это скопление легких дел, которые вы не сделали, когда должны были сделать»'
        ]
    }
  },
  computed: {
    motivationText() {
        return this.motivationArr[Math.trunc(Math.random() * this.motivationArr.length)]
    }
  }
}
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style lang="scss">
.motivation-text {
    display: inline-block;
    padding-bottom: 10px;
    font-size: 19px;
    line-height: 25px;
    color: #fff;
    font-weight: bold;
    text-align: center;
    letter-spacing: 2px;
}
</style>